# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # scales module repeats
width_multiple: 0.5  # scales convolution channels

# YOLOv8.0l backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 1]]
  - [-1, 1, Conv, [32, 3, 2]]  # 1-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 2-P2/4
  - [-1, 2, C2f, [64, True]]
  - [-1, 1, ESD, [128, 3, 2]]  # 4-P3/8
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, ESD, [256, 3, 2]]  # 6-P4/16
  - [-1, 3, C2f, [256, True]]
  - [-1, 1, ESD, [512, 3, 2]]  # 8-P5/32
  - [-1, 2, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]]  # 10

# YOLOv8.0n head
head:
  - [-1, 1, SNI, [2]]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -2, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 256, 1, 1 ] ] # 19-----
  - [-1, 1, C2f, [256]]  # 20

  - [-1, 1, SNI, [2]]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [ -1, 1, Conv, [ 128, 1, 1 ] ]
  - [ -2, 1, Conv, [ 128, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 128, 1, 1 ] ] # 29----
  - [ -1, 1, Conv, [ 128, 1, 1 ] ]
  - [ -2, 1, Conv, [ 128, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 128, 1, 1 ] ]
  - [-1, 1, C2f, [128]] # 37

  - [-1, 1, ESD, [256, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]  # cat head P4
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -2, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -2, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [-1, 1, C2f, [256]] # 54

  - [-1, 1, ESD, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [ -1, 1, Conv, [ 512, 1, 1 ] ]
  - [ -2, 1, Conv, [ 512, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 512, 1, 1 ] ] # 49
  - [ -1, 1, Conv, [ 512, 1, 1 ] ]
  - [ -2, 1, Conv, [ 512, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 512, 1, 1 ] ] # 73
  - [-1, 1, C2f, [512]] # 71

  - [[37, 54, 71], 1, Detect, [nc]]  # Detect(P3, P4, P5)
