# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

  - [-1, 1, SNIr, [1024, 2]]  #   P4
  - [-1, 1, C2f, [512, True]]
  - [-1, 1, SNIr, [512, 2]]   #   P3
  - [-1, 1, Conv, [256, True]] #   13


# YOLOv8.0n head
head:

  - [[6, 11], 1, Infos, [1024]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4, 13], 1, Infos, [256]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)           18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Infos, [512]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)           21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Infos, [1024]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)               24

  - [[18, 21, 24], 1, Segment, [nc, 32, 256]]  # Detect(P3, P4, P5)
