# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, nn.Identity, []]

  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9  10

  - [ 0, 1, LAPM1, [ 3,1,0.02 ] ] # 11 1/2
  - [-1, 1, LAPM2, [ 1,1,0.02 ] ] # 12 1/4
  - [-1, 1, LAPM2, [ 1,1,0.02 ] ] # 13 1/8
  - [-1, 1, LAPM2, [ 1,1,0.02 ] ] # 14 1/16
  - [-1, 1, LAPM2, [ 1,1,0.02 ] ] # 15 1/32

head:
  - [10, 1, SNIr, [1024, 2]]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13   18

  - [-1, 1, SNIr, [512, 2]]
  - [[-1, 5, 13], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)   21

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14, 18], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)   24

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10, 15], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)   27

  - [[21, 24, 27], 1, Segment, [nc, 32, 256]]  # Detect(P3, P4, P5)