# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 100  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.5  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Focus, [128]]  # 1-P2/4
  - [-1, 3, EdgeCSP, [128]]
  - [-1, 1, Focus, [256]]  # 3-P3/8
  - [-1, 6, EdgeCSP, [256]]
  - [-1, 1, Focus, [512]]  # 5-P4/16
  - [-1, 6, EdgeCSP, [512]]
  - [-1, 1, Focus, [1024]]  # 7-P5/32
  - [-1, 3, EdgeCSP, [1024]]

# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]]
