nc: 80 # number of classes
depth_multiple: 1.0  # expand model depth
width_multiple: 1.0  # expand layer channels

# CSPVoVNet backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 2]],     # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],     # 1-P2/4
   [-1, 1, Conv, [64, 3, 1]],     # 2
   [-1, 1, VoVCSPO, [64]],         # 3
   [[-2, -1], 1, Concat, [1]],    # 4
   [-1, 1, nn.MaxPool2d, [2, 2]], # 5-P3/8
   [-1, 1, Conv, [128, 3, 1]],    # 6
   [-1, 1, VoVCSPO, [128]],        # 7
   [[-2, -1], 1, Concat, [1]],    # 8
   [-1, 1, nn.MaxPool2d, [2, 2]], # 9-P4/16
   [-1, 1, Conv, [256, 3, 1]],    # 10
   [-1, 1, VoVCSPO, [256]],        # 11
   [[-2, -1], 1, Concat, [1]],    # 12
   [-1, 1, nn.MaxPool2d, [2, 2]], # 13-P5/32
   [-1, 1, Conv, [512, 3, 1]],    # 14
  ]

head:
  - [ -1, 1, Classify, [ nc ] ]